First/src/DataProcessors/ПересчетПоступлений/ПересчетПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПересчетПоступлений</name>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

First/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьПоВозрастанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/DataProcessors/ПересчетПоступлений/Forms/Форма/Module.bsl
&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	
	Запрос = Новый Запрос;

	// Ищем ссылки на документы запросом
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
				   |ГДЕ
				   |	ПоступлениеТоваровИУслуг.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаЗавершенияПериода";
	Запрос.УстановитьПараметр("ДатаНачалаПериода", Объект.ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаЗавершенияПериода", Объект.ДатаЗавершенияПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебираем Таблицу Товары в найденых документах
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
			СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		КонецЦикла;
		
		// Сохраняем
		ДокументОбъект.Записать();		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Для проверки решения по заданию NewModules/SID/3_ConfigUpdate.md (Задача 4) 
// отключил пересчет Суммы "Документы - ПоступлениеТоваровИУслуг - Товары - Сумма"
Процедура ПересчитатьДокументы(Команда)
	ПересчитатьДокументыНаСервере();
КонецПроцедуры
